Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G28B.tmx
Source language: en_us
Languages: zh_cn

source: Dorothy Parker Biography
zh_cn: 多萝西·帕克传

source: Dorothy Parker Rothschild represented one of the most accomplished feminist and successful literary writers in women's history.
zh_cn: 多萝西·帕克·罗斯切尔德，是女性历史上最有成就的女权主义者和最成功的文学作家中的一员。

source: Existing from 1893-1967, she became known as one of the most brilliant writers from the early 1900s.
zh_cn: 她生于1893年，卒于1967年，被认为是二十世纪初最有才华的作家之一。

source: Born in West End, New Jersey, and attaining her success from New York, she became one of the most brilliant writers that revolutionized American thinking then and after.
zh_cn: 帕克出生于新泽西州西区，却在纽约获得成功。从那时起，她就与其他最优秀的作家一起改变了美国人的思想。

source: Dorothy Parker lived a full and prosperous life, even though she did not have a happy childhood.
zh_cn: 尽管多萝西·帕克并没有一个幸福的童年，她却拥有完整而丰满的一生。

source: Growing up, having bad relationships with her father and stepmother, she never had the privilege of growing up with a mother.
zh_cn: 在成长过程中，她与父亲和继母的关系并不好，也从没享受过在母亲的陪伴下长大的特权。

source: Her mother died on July 20, 1897, when Dorothy was only four years of age, and her father died shortly after on December 28, 1913.
zh_cn: 她的母亲在1897年7月20号去世，那时多萝西才刚刚四岁。而她的父亲在不久后的1913年9月28日又过世了。

source: Right before the death of her father was the passing away of her "brother Henry, who died on the passage home from a vacation with his wife Lissie aboard a first class steamship the Titanic, which sank in 1912." (Click here to see the source for this quote.)
zh_cn: 就在她父亲去世之前，她的“哥哥亨利和他的妻子丽莎随着1912年沉没的泰坦尼克号一起去了，当时他们在一等舱里”。

source: As a sad woman, stung with depression and alcoholism her entire adult life, she had a successful and productive life.
zh_cn: 多萝西成了一个悲伤的人，她成年后的整个人生都深陷在抑郁和酒精里。尽管如此，帕克的一生仍然是成功的，并有众多作品诞生。

source: In 1916, at the age of 23, she joined the editorial staff of Vogue.
zh_cn: 1916年23岁时，帕克加入了《Vogue》编辑社。

source: Then in 1917 she started working for as a theater critic for Vanity Fair, who had published her first poem entitled "Any Porch," (1914), in which she received $12.
zh_cn: 在之后的1917年，她开始作为剧评员为《名利场》工作。杂志上刊登了她的第一首诗——《任意走廊》（1914），由此她挣了12美元。

source: Vanity Fair became a significant variable in her life in that she met her associates whom she would form the Algonquin Round Table/Vicious Circle, an intellectual and renowned literary circle.
zh_cn: 《名利场》成了帕克人生中一个非常重要的转折点，在那里她遇到了自己的同伴，后者与她共同成立了阿冈昆圆桌会（又称堕落者联会），那是一个充满智者的著名的文学圈子。

source: Because of unfair reasons, Dorothy was let go in her position at Vanity Fair in which case her colleague and later her closest confidant, Robert Benchley, also resigned; Parker and Benchley then became partners in a writing firm called "Park-Bench."
zh_cn: 出于某些不公正的原因，帕克被《名利场》解雇了。而她的同事，也是她后来的密友罗伯特·本奇利也申请了辞职。随后，帕克和本奇利成为了伙伴并成立了一个名为“Park-Bench”的写作机构。

source: At a luncheon in the Algonquin Hotel they met an elite group of intellectuals who became part of their literary circle.
zh_cn: 在阿冈昆酒店举办的一次午宴上，他们结识了一个精英组织，这些人后来成为了那个文学团体的一部分。

source: Similar to the "Radical Women of Greenwich Village," she portrayed the liberated feminist of the 1900s.
zh_cn: 与“格林威治激进女性联会”相似的是，帕克也在二十世纪初期扮演了一个不受管制的女权主义者的角色。

source: But unlike those women, Parker's roots were not from a wealthy family, who were attempting to escape their repressing elite high class society in which they may have grown up or their possessive families and/or husbands.
zh_cn: 但是与那些姐妹们不同的是，帕克并出自于一个富余的家庭。那些女士们成长在高等社会的精英家庭里，或者嫁给了一个那样背景的老公，于是她们便总是想逃离来自于这种自身环境的压力。

source: The Algonquin Round Table exemplified one of her most brilliant and accomplished achievements, for this brought together the most brilliant literary writers of that time, including Robert Benchley, Robert E. Sherwood, James Thurber, George S. Kaufman, Edna Ferber, Franklin P. Adams, and many others.
zh_cn: 阿冈昆圆桌会是帕克众多颇具才华而且出名的成就中的一个，因为它汇集了众多在当时非常厉害的作家，其中就包括罗伯特·本奇利、罗伯特 E·舍伍德、詹姆斯·瑟伯、乔治 S·考夫曼、艾德娜·费勃、富兰克林 P·亚当斯，等等。

source: In 1917, she also met her husband, Edwin Pond Parker, a young stockbroker, who she divorced in the same year.
zh_cn: 1917年，帕克还与年轻的股票经理人埃德温·庞德·帕克相遇。两人结为夫妻，却又在同一年离婚。

source: She married again in 1934 to Allan Campbell, with whom she formed a screen writing team at Paramount Pictures.
zh_cn: 1934年，帕克嫁给了艾伦·康贝尔。他们后来一同在派拉蒙电影公司成立了一个剧本创作团队。

source: Divorced after 16 years of marriage, Parker remarried Campbell again in 1950 and stayed with him until his death from a heart attack in 1967.
zh_cn: 经历了十六年的婚姻生活后，帕克与康贝尔离婚，又于1950年复婚。自此两人相伴，直到1967年的一次心脏病突发把康贝尔从帕克身边夺走。

source: Susan Shapiro argues that she may have written her own eulogy, which may have included quotes from her poem "The Braggart," stating, "You will be frail and musty/with peering, furtive head/, While I am Young and Lusty/ Among the roaring dead."
zh_cn: 苏珊·夏皮罗称，也许是多萝西写了自己的悼词，那其中可能包含了对她的诗作《吹牛者》的引用——“你会变得脆弱而落伍,在偷偷摸摸的凝视里。而我依然年轻旺盛，在喧闹嘈杂的死亡里”。

source: A witty and brilliant conversationalist, Dorothy Parker contributed to many works of literature including newspaper columns, reviews, screenplays, satirical verses, and books; she is especially known for short stories, poems, and powerful quotes.
zh_cn: 帕克富有智慧而健谈，为很多文学作品做出了贡献，包括报纸专栏、评论、剧本、讽刺诗，和书籍。而她创作的短篇小说、诗歌，以及她强有力的引论能力则尤为出名。

source: Her tone is ironical, poignant, and often cuttingly witty and cynical.
zh_cn: 她的言辞尖锐深刻，讽刺味十足，在挖苦中又显得诙谐而老道世俗。

source: Many of her works were written from a practical point of view, and her pessimistic writings still carried the weight of powerful prose.
zh_cn: 她的很多作品都是以现实的角度出发，悲观的写作风格却依旧带着沉甸甸的散文重量。

source: Regina Barreca wrote, in the introduction to Parker's Collected Stories, that "Parker's wit caricatures the self-deluded, the powerful, the autocratic, the vain, the sill, and the self important; it does not rely on men and small formulas, and it never ridicules the marginalized, the sideline or the outcast.
zh_cn: 里贾纳·巴瑞卡在为《帕克小说集》所作的序中写道：“帕克的才智为那些自欺欺人的骗子、掌权者、独裁者、虚荣家、蠢蛋，还有那些自以为很重要的人，画了一幅绝妙的讽刺画。那智慧并不依赖于人和细枝末节，也从不揶揄社会边缘者与流浪汉。

source: When Parker goes for the jugular, its usually a vein with blueblood in it."
zh_cn: 当帕克像医生寻找静脉一般追寻要害时，那根血管里就必定流着深蓝的血液。”

source: According to Barreca, many of the critics of her time painted her as having "sold out" and "wasted herself by writing about narrow topics."
zh_cn: 据巴瑞卡所述，帕克那个时期的许多批评都把自己写成是“被出卖了”或者“在写作狭隘的主题中浪费生命”。

source: Nevertheless, her works paved the way for other realist writings by intellectuals, and other writers, which transformed American thought.
zh_cn: 尽管如此，她的作品依然为其他文人的现实主义写作铺平了道路，而又是这些文人改变了美国的思想。
